eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаПроект/абс_ЗаявкаНаПроект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаПроект</name>
  <registerRecords>AccumulationRegister.абс_ДДСПоПроектам</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроекта</name>
    <type>
      <types>CatalogRef.абс_ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроекта</name>
    <type>
      <types>EnumRef.абс_СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПроектов</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТитула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетРеализацииПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкупаемостиПроекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроекта</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа_удалить</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийЗаявкаНаПроект</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяТЭО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортфельПроекта</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДанных</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Доходный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуетсяСогласованиеРПвЗЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоходыПроектов</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходыПроектов</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты_удалить</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТитула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПроекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриоритетРеализацииПроекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПроекта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПроекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкупаемостиПроекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПроекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПроекта</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТЭО</name>
      <type>
        <types>CatalogRef.абс_ТЭО</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборотыБюджетов</name>
    <attributes>
      <name>абс_ТипРасхода</name>
      <type>
        <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_КВ</name>
      <type>
        <types>CatalogRef.абс_КапитальныеВложения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяОборотов</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ТипКонтрагента</name>
      <type>
        <types>CatalogRef.абс_ТипыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ТипСети</name>
      <type>
        <types>CatalogRef.абс_ТипыСетей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСценария</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлатежиПоПроектам</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактОперФакт</name>
      <type>
        <types>EnumRef.абс_ФактОперФакт</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаАванс</name>
      <type>
        <types>EnumRef.ВидыОтчетовПоПлатежамКомиссия</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <comment>Незакрытый документ поставки/оплаты</comment>
      <type>
        <types>DocumentRef.ОтчетКомитентуОПродажах</types>
        <types>DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</types>
        <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
        <types>DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</types>
        <types>DocumentRef.ОплатаОтПокупателяПлатежнойКартой</types>
        <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
        <types>DocumentRef.АккредитивПолученный</types>
        <types>DocumentRef.РеализацияУслугПоПереработке</types>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
        <types>DocumentRef.ПоступлениеДопРасходов</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.АккредитивПереданный</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОперацияБух</types>
        <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ПоступлениеНМА</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ИнкассовоеПоручениеПолученное</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
        <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
        <types>DocumentRef.ПередачаНМА</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПолучениеУслугПоПереработке</types>
        <types>DocumentRef.ИнкассовоеПоручениеПереданное</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПроектов/абс_СтатусыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПроектов</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДТР</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭИ</name>
  </enumValues>
  <enumValues>
    <name>РазработкаТЭО</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеИК</name>
  </enumValues>
  <enumValues>
    <name>РазраоткаИТРДП</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДЭИ</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Эксплуатация</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>ОтказСогласования</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеТЭО</name>
  </enumValues>
  <enumValues>
    <name>ТехническоеСогласование</name>
  </enumValues>
  <enumValues>
    <name>РазработкаИИТРТЭО</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаПроект/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСтатустНаСервере();
	мСтатус = Объект.СтатусПроекта;
	ОбновитьВидимость();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("ЗаявкаНаПроект", Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.СтатусПроекта = Перечисления.абс_СтатусыПроектов.Подготовка;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаПроекта) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияПроекта) Тогда
		
		СрокиПроекта = "ввести сроки проекта";
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура мСтатусПриИзменении(Элемент)
	
	ЗаполнитьСтатустНаСервере();
	Объект.СтатусПроекта = мСтатус;
	ОбновитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатустНаСервере()

	Документы.абс_ЗаявкаНаПроект.ЗаполнитьСписокДоступныхСтатусов(Элементы.мСтатус.СписокВыбора,Объект.Ссылка);

КонецПроцедуры // ()

&НаКлиенте
Процедура ОбновитьВидимость()
	
	УстановитьТолькоПросмотрВсемЭлементам(Ложь);
	Если не мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.Подготовка") Тогда
		
		УстановитьТолькоПросмотрВсемЭлементам();
		
		Если мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.СогласованиеДЭИ") Тогда
            Элементы.СуммаДохода.ТолькоПросмотр  = Ложь;
			Элементы.СуммаРасхода.ТолькоПросмотр = Ложь;
			
		ИначеЕсли мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.СогласованиеДТР") Тогда	
			
			Элементы.ДоходыПроектов.ТолькоПросмотр = Ложь;
			Элементы.ТЭО.ТолькоПросмотр            = Ложь;
			
			
		ИначеЕсли мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.РазработкаТЭО") Тогда
			
			Элементы.ТЭО.ТолькоПросмотр            = Ложь;
		ИначеЕсли мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.Согласован") Тогда
			
			
			
		КонецЕсли;	
	КонецЕсли;	
    //сроки проекта
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаПроекта) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияПроекта) Тогда
		СрокиПроекта = "ввести сроки проекта";
	Иначе
		СрокиПроекта = "с "+Формат(Объект.ДатаНачалаПроекта,"ДЛФ=DD")+" по "+Формат(Объект.ДатаОкончанияПроекта,"ДЛФ=DD"); 
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьТолькоПросмотрВсемЭлементам(мТолькоПросмотр = Истина)

	Для каждого Элемент Из Элементы Цикл
		Если Элемент = Элементы.ФормаКоманднаяПанель ИЛИ
			Элемент = Элементы.мСтатус ИЛИ
			Элемент = Элементы.мСтатусКонтекстноеМеню ИЛИ
			Элемент = Элементы.Группа3 ИЛИ
			Элемент = Элементы.Группа1 ИЛИ
			Элемент = Элементы.Группа2 ИЛИ
			Элемент = Элементы.Группа4 ИЛИ
			Элемент = Элементы.Группа5 ИЛИ
			Элемент = Элементы.ПлановаяСтоимость ИЛИ
			Элемент = Элементы.ГруппаПроекты ИЛИ
            Элемент = Элементы.ПроектыТЧ ИЛИ
			Элемент = Элементы.НомерДата Тогда
			Продолжить;
		КонецЕсли;	
		//Сообщить(Элемент);
		Попытка
			Элемент.ТолькоПросмотр = мТолькоПросмотр;
		Исключение
			//Элемент.Доступность    = НЕ мТолькоПросмотр;
		КонецПопытки;	
	КонецЦикла;

КонецПроцедуры // ()

&НаКлиенте
Процедура ПроектыПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элементы.Проекты.ТекущиеДанные;
    УдалитьСвязанные(ТекСтрока.КлючСтроки);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСвязанные(КлючСтроки)
	
	СтруктураПоиска = Новый Структура("КлючСтроки",КлючСтроки);
	ОбъектЗначение   = РеквизитФормыВЗначение("Объект");
	СтрокиДляУдаления = ОбъектЗначение.ВнутренниеЛимитыПроектов.НайтиСтроки(СтруктураПоиска);
	
	Для каждого Строка Из СтрокиДляУдаления Цикл
	
		 ОбъектЗначение.ВнутренниеЛимитыПроектов.Удалить(Строка);
	
	КонецЦикла;
	
	СтрокиДляУдаления = ОбъектЗначение.ДоходыПроектов.НайтиСтроки(СтруктураПоиска);
	
	Для каждого Строка Из СтрокиДляУдаления Цикл
	
		 ОбъектЗначение.ДоходыПроектов.Удалить(Строка);
	
	КонецЦикла;
	
	СтрокиДляУдаления = ОбъектЗначение.РасходыПроектов.НайтиСтроки(СтруктураПоиска);
	
	Для каждого Строка Из СтрокиДляУдаления Цикл
	
		 ОбъектЗначение.РасходыПроектов.Удалить(Строка);
	
	 КонецЦикла;
	 
	 ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
	 
КонецПроцедуры 


&НаКлиенте
Процедура ПроектыПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Проекты.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекСтрока.КлючСтроки) Тогда
		ТекСтрока.КлючСтроки = ПолучитьНовыйКлюч(Объект.Проекты);
	КонецЕсли;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Отбор     = Новый ФиксированнаяСтруктура("КлючСтроки",ТекСтрока.КлючСтроки);
	
	Элементы.ДоходыПроектов.ОтборСтрок           = Отбор;
	Элементы.РасходыПроектов.ОтборСтрок          = Отбор;
	Элементы.ВнутренниеЛимитыПроектов.ОтборСтрок = Отбор;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьНовыйКлюч(Таблица)
	
	 НовыйКлюч = 0;
	 Для каждого СтрокаТаблицы Из Таблица Цикл
	 
	 	НовыйКлюч = ?(СтрокаТаблицы.КлючСтроки > НовыйКлюч, СтрокаТаблицы.КлючСтроки,НовыйКлюч);
	 
	 КонецЦикла;
	 
	 Возврат НовыйКлюч + 1;
	 
КонецФункции	

&НаКлиенте
Процедура ВнутренниеЛимитыПроектовПриИзменении(Элемент)
	
	ТекСтрокаПроекты = Элементы.Проекты.ТекущиеДанные;
	
	Если ТекСтрокаПроекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекСтрока = Элементы.ВнутренниеЛимитыПроектов.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекСтрока.КлючСтроки) Тогда
		ТекСтрока.КлючСтроки = ТекСтрокаПроекты.КлючСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПроектовПриИзменении(Элемент)
	
	ТекСтрокаПроекты = Элементы.Проекты.ТекущиеДанные;
	Если ТекСтрокаПроекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекСтрока = Элементы.ДоходыПроектов.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекСтрока.КлючСтроки) Тогда
		ТекСтрока.КлючСтроки = ТекСтрокаПроекты.КлючСтроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасходыПроектовПриИзменении(Элемент)
	
	ТекСтрокаПроекты = Элементы.Проекты.ТекущиеДанные;
	Если ТекСтрокаПроекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекСтрока = Элементы.РасходыПроектов.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекСтрока.КлючСтроки) Тогда
		ТекСтрока.КлючСтроки = ТекСтрокаПроекты.КлючСтроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроектыПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Проекты.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Отбор     = Новый ФиксированнаяСтруктура("КлючСтроки",ТекСтрока.КлючСтроки);
	
	Элементы.ДоходыПроектов.ОтборСтрок           = Отбор;
	Элементы.РасходыПроектов.ОтборСтрок          = Отбор;
	Элементы.ВнутренниеЛимитыПроектов.ОтборСтрок = Отбор;
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	
	//Если НЕ РаботаСДиалогами.ЗаписатьНовыйОбъектВФорме(ЭтаФорма) Тогда
	//	Возврат;
	//КонецЕсли;
	
	СтруктураДляСпискаИзображдений = Новый Структура("ОтборОбъектИспользование, ОтборОбъектЗначение, ДоступностьОтбораОбъекта, ВидимостьКолонкиОбъекта", Истина, Объект.Ссылка, Ложь, Ложь);
	СтруктураДляСпискаДополнительныхФайлов = Новый Структура("ОтборОбъектИспользование, ОтборОбъектЗначение, ДоступностьОтбораОбъекта, ВидимостьКолонкиОбъекта", Истина, Объект.Ссылка, Ложь, Ложь);
	ОбязательныеОтборы = Новый Структура("Объект", Объект.Ссылка);
	
	РаботаСФайлами.ОткрытьФормуСпискаФайловИИзображений(СтруктураДляСпискаИзображдений, СтруктураДляСпискаДополнительныхФайлов, ОбязательныеОтборы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	врСтатус =  абс_БизнесПроцессы.ПолучитьСтатусСогласованияПроекта(Объект.Ссылка);
	
	Если мСтатус <> врСтатус Тогда
		
		Объект.ПричинаИзмененияСтатуса = "";
		ВвестиСтроку(Объект.ПричинаИзмененияСтатуса, "Укажите причину изменения статуса.",,Истина);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СрокиПроектаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Результат = ОткрытьФормуМодально("Документ.абс_ЗаявкаНаПроект.Форма.ФормаВыбораПериода",Новый Структура("ДатаНачала,ДатаОкончания",
																							ОБъект.ДатаНачалаПроекта,ОБъект.ДатаОкончанияПроекта));
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОБъект.ДатаНачалаПроекта    = Результат.ДатаНачала;
	ОБъект.ДатаОкончанияПроекта = Результат.ДатаОкончания;
	СрокиПроекта = "с "+Формат(Объект.ДатаНачалаПроекта,"ДЛФ=DD")+" по "+Формат(Объект.ДатаОкончанияПроекта,"ДЛФ=DD");
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьСтатустНаСервере();
	мСтатус = Объект.СтатусПроекта;
	ОбновитьВидимость();
    Элементы.ИсторияСогласования1.Обновить();
	
	Если Объект.СтатусПроекта = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.Согласован") Тогда
		 ТекстВопроса = "Создать номенклатурные группы и проекты?";
		 Кнопки       = РежимДиалогаВопрос.ДаНет;
		 Если Вопрос(ТекстВопроса,Кнопки) = КодВозвратаДиалога.Да Тогда
			 
			 Документы.абс_ЗаявкаНаПроект.СформироватьНоменклатурныеГруппыИПроекты(Объект.Ссылка);
			 ПечитатьДанныеФОрмы();
			 Элементы.Проекты.Обновить();
			 ЭтаФорма.ОбновитьОтображениеДанных();
			 
		 КонецЕсли;
		
	 КонецЕсли;
	 
	 УстановитьПараметрСпискаНаСервере();
	 Элементы.Проекты.Обновить();
	 ЭтаФорма.ОбновитьОтображениеДанных();
 КонецПроцедуры
 
 &НаСервере
 Процедура УстановитьПараметрСпискаНаСервере()
	 ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("ЗаявкаНаПроект", Объект.Ссылка);
 КонецПроцедуры	 

  &НаСервере
 Процедура ПечитатьДанныеФОрмы()
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_ЗаявкаНаПроектПроекты.НоменклатурнаяГруппа,
		|	абс_ЗаявкаНаПроектПроекты.Проект,
		|	абс_ЗаявкаНаПроектПроекты.НомерСтроки
		|ИЗ
		|	Документ.абс_ЗаявкаНаПроект.Проекты КАК абс_ЗаявкаНаПроектПроекты
		|ГДЕ
		|	абс_ЗаявкаНаПроектПроекты.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ТЧПроекты = Объект.Проекты;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЧ = ТЧПроекты.НайтиСтроки(Новый Структура("НомерСтроки",ВыборкаДетальныеЗаписи.НомерСтроки));
		СтрокаТЧ[0].НоменклатурнаяГруппа = ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа;
		СтрокаТЧ[0].Проект               = ВыборкаДетальныеЗаписи.Проект;
	КонецЦикла;
 
	 
 КонецПроцедуры	 

&НаКлиенте
 Процедура ПроектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	 
	 
	 
 КонецПроцедуры
